Revit 2027 API
ColorFillScheme.CanUpdateEntry Method
 Checks whether entry exists in the scheme and not the same as input one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanUpdateEntry(
	ColorFillSchemeEntry entry
)
Public Function CanUpdateEntry (
	entry As ColorFillSchemeEntry
) As Boolean
public:
bool CanUpdateEntry(
	ColorFillSchemeEntry^ entry
)
member CanUpdateEntry :
        entry : ColorFillSchemeEntry -> bool
Parameters
entry ColorFillSchemeEntry
 The entry to be updated.
Return Value
Boolean
 Returns true if entry exist in scheme and not the same as input one, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace